In [27]:
import pandas as pd

In [28]:
raw_data = {
         "city": ["Tripoli", "Sydney", "Tripoli", "Rome", "Rome", "Tripoli","Rome", "Sydney", "Sydney"],
         "rank": ["1st", "2nd", "1st", "2nd", "1st", "2nd","1st", "2nd", "1st"], 
         "score1": [44, 48, 39, 41, 38, 44, 34, 54, 61],
         "score2": [67, 63, 55, 70, 64, 75, 45, 66, 72]
        }
        
df = pd.DataFrame(raw_data, 
                  index = pd.Index(['A','B','C','D','E','F','G','H','I'], name='letter'),
                  columns = pd.Index(['city', 'rank','score1','score2'],name='attributes'))
df

attributes     city rank  score1  score2
letter
A           Tripoli  1st      44      67
B            Sydney  2nd      48      63
C           Tripoli  1st      39      55
D              Rome  2nd      41      70
E              Rome  1st      38      64
F           Tripoli  2nd      44      75
G              Rome  1st      34      45
H            Sydney  2nd      54      66
I            Sydney  1st      61      72

In [30]:
df.rename(index={'A':'a','G':'gg'},inplace=True)

In [32]:
df.rename(,index={'a':'AA','gg':'GG'},columns={'rank': 'Rank'}, inplace=True)

In [35]:
df.columns = ['City', 'Level', 'Score1','Score2']

In [34]:
df.columns

Index(['city', 'Rank', 'score1', 'score2'], dtype='object', name='attributes')

In [36]:
df

           City Level  Score1  Score2
letter
a       Tripoli   1st      44      67
B        Sydney   2nd      48      63
C       Tripoli   1st      39      55
D          Rome   2nd      41      70
E          Rome   1st      38      64
F       Tripoli   2nd      44      75
gg         Rome   1st      34      45
H        Sydney   2nd      54      66
I        Sydney   1st      61      72